# Datos del Titanic

In [1]:
import seaborn as sns # IMPORTARMOS LIBRERIA Y TRAE VARIOS DATA-SET
# IMFORMACION DE DATA FRAME : https://www.kaggle.com/

In [5]:
titanic = sns.load_dataset("titanic") # CARGAMOS DATOS A LA VARIABLE

In [8]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
titanic.shape # cantidad de datos filas x columnas

(891, 15)

In [10]:
import numpy as np
import pandas as pd

In [12]:
titanic['survived'] = pd.Categorical(titanic['survived']) # antes era numerica y la convertivos a Factor (Variable categorica)

In [13]:
titanic['pclass'] = pd.Categorical(titanic['pclass'])# tranforma la clase a categoria

In [38]:
titanic['sex'] = pd.Categorical(titanic['sex'])

In [39]:
titanic['deck'] = pd.Categorical(titanic['deck'])

## Tablas de frecuencias de una variable

In [15]:
tab = pd.crosstab(index = titanic['survived'], # toma los objetos en forma de array y cuenta y agrupa a otro nuevo dataframe
                 columns = 'pasajeros') # nombre de la columna
tab

col_0     pasajeros
survived
0               549
1               342

In [16]:
type(tab)

pandas.core.frame.DataFrame

In [17]:
pd.crosstab(index = titanic['pclass'], # la clase de pasajeros
           columns = "pasajeros")

col_0   pasajeros
pclass
1             216
2             184
3             491

In [18]:
pd.crosstab(index = titanic['sex'], # cantidad de personas por sexo
           columns = "pasajeros")

col_0   pasajeros
sex
female        314
male          577

In [31]:
tab_c = pd.crosstab(index = titanic['deck'],# tipo de cubiertas del titanic
           columns = "count")
tab_c
# titanic.deck # ---> para mi todos los datos con NaN

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [22]:
tab_c.sum()# conocer cuantas tenian cabina

col_0
count    203
dtype: int64

In [25]:
tab_c.shape

(7, 1)

In [29]:
tab_c.iloc[1:4] # estraer datos de rango segmento

col_0  count
deck
B         47
C         59
D         33

In [32]:
tab_c/tab_c.sum() # tabla de las FRECUENCIAS RELATIVAS

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

# Tablas de contingencia de dos variable

In [35]:
survived_sex = pd.crosstab(index = titanic['survived'],
                          columns = titanic['sex'])
survived_sex

sex       female  male
survived
0             81   468
1            233   109

In [37]:
survived_sex.index = ["murieron", "sobrevivio"]# CAMBIAR EL NOMBRE DEL VARIABLE INDICE
survived_sex

sex         female  male
murieron        81   468
sobrevivio     233   109

In [47]:
survived_class = pd.crosstab(index = titanic['survived'], 
                            columns = titanic['pclass'])
survived_class

pclass      1   2    3
survived
0          80  97  372
1         136  87  119

In [48]:
survived_class = pd.crosstab(index = titanic['survived'], 
                            columns = titanic['pclass'])

survived_class.index = ["MURIO", "VIVIO"]
survived_class.columns = ["PRIMERA", "SEGUNDA", "TERCARA"]
survived_class

       PRIMERA  SEGUNDA  TERCARA
MURIO       80       97      372
VIVIO      136       87      119

In [49]:
survived_class = pd.crosstab(index = titanic['survived'], 
                            columns = titanic['pclass'],
                            margins = True) # PARA MOSTRAR EL TOTAL X FILA Y COLUMNA (MARGINALES)

survived_class.index = ["murio", "sobrevivio", "total_clase"] # COLOCAR NOMBRE INDEX FILA
survived_class.columns = ["primera", "segunda", "tercera", "total_superv"]# COLOCAR NOMBRE COLUMNAS
survived_class

             primera  segunda  tercera  total_superv
murio             80       97      372           549
sobrevivio       136       87      119           342
total_clase      216      184      491           891

## Frecuencias relativas globales

In [51]:
survived_class/survived_class.loc["total_clase", "total_superv"]

              primera   segunda   tercera  total_superv
murio        0.089787  0.108866  0.417508      0.616162
sobrevivio   0.152637  0.097643  0.133558      0.383838
total_clase  0.242424  0.206510  0.551066      1.000000

## Frecuencias relativas marginales

In [52]:
survived_class/survived_class.loc["total_clase"]

             primera   segunda   tercera  total_superv
murio        0.37037  0.527174  0.757637      0.616162
sobrevivio   0.62963  0.472826  0.242363      0.383838
total_clase  1.00000  1.000000  1.000000      1.000000

In [57]:
survived_class.div(survived_class.loc["total_clase"], axis = 1)# SACAR LA FRECUENCIAS RELATIVAS MARGINALES

             primera   segunda   tercera  total_superv
murio        0.37037  0.527174  0.757637      0.616162
sobrevivio   0.62963  0.472826  0.242363      0.383838
total_clase  1.00000  1.000000  1.000000      1.000000

In [53]:
survived_class.T/survived_class["total_superv"] # TRANSPONER LA TABLA

                 murio  sobrevivio  total_clase
primera       0.145719    0.397661     0.242424
segunda       0.176685    0.254386     0.206510
tercera       0.677596    0.347953     0.551066
total_superv  1.000000    1.000000     1.000000

In [58]:
survived_class.div(survived_class["total_superv"], axis = 0)

              primera   segunda   tercera  total_superv
murio        0.145719  0.176685  0.677596           1.0
sobrevivio   0.397661  0.254386  0.347953           1.0
total_clase  0.242424  0.206510  0.551066           1.0

## Tablas multi dimensionales

In [59]:
surv_sex_class = pd.crosstab(index = titanic["survived"],
                            columns = [titanic["sex"], titanic["pclass"]],
                            margins = True)
surv_sex_class

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [43]:
surv_sex_class["female"] # FILTRAR SOLO MUJERES

pclass     1   2    3
survived
0          3   6   72
1         91  70   72
All       94  76  144

In [64]:
surv_sex_class["female"][1] # FILTRO DE MUJERS EN CLASE 1

survived
0       3
1      91
All    94
Name: 1, dtype: int64

In [65]:
surv_sex_class/surv_sex_class.loc["All"] # MARGINAL POR COLUMNAS

sex         female                     male                           All
pclass           1         2    3         1         2         3
survived
0         0.031915  0.078947  0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053  0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000  1.0  1.000000  1.000000  1.000000  1.000000

In [68]:
so = surv_sex_class/(surv_sex_class.loc["All"]/100)

In [74]:
np.around(so)

sex      female                 male                  All
pclass        1      2      3      1      2      3
survived
0           3.0    8.0   50.0   63.0   84.0   86.0   62.0
1          97.0   92.0   50.0   37.0   16.0   14.0   38.0
All       100.0  100.0  100.0  100.0  100.0  100.0  100.0